tests/Integration/Mocks/Responses/single-payment.json

{
    "id": "pi_test_payment",
    "object": "payment_intent",
    "amount": 500,
    "amount_capturable": 0,
    "amount_details": {
        "tip": []
    },
    "amount_received": 500,
    "application": null,
    "application_fee_amount": null,
    "automatic_payment_methods": {
        "allow_redirects": "always",
        "enabled": true
    },
    "canceled_at": null,
    "cancellation_reason": null,
    "capture_method": "automatic",
    "client_secret": "pi_test_secret",
    "confirmation_method": "automatic",
    "created": 1739516481,
    "currency": "usd",
    "customer": "cus_Rl5cRkOlS4PAQ3",
    "description": null,
    "invoice": null,
    "last_payment_error": null,
    "latest_charge": "ch_test_latest_charge",
    "livemode": false,
    "metadata": [],
    "next_action": null,
    "on_behalf_of": null,
    "payment_method": "test_payment_method",
    "payment_method_configuration_details": {
        "id": "pmc_test_payment_method_configuration_details",
        "parent": null
    },
    "payment_method_options": {
        "card": {
            "installments": null,
            "mandate_options": null,
            "network": null,
            "request_three_d_secure": "automatic"
        },
        "cashapp": [],
        "link": {
            "persistent_token": null
        }
    },
    "payment_method_types": [
        "card",
        "link",
        "cashapp"
    ],
    "processing": null,
    "receipt_email": null,
    "review": null,
    "setup_future_usage": null,
    "shipping": null,
    "source": null,
    "statement_descriptor": null,
    "statement_descriptor_suffix": null,
    "status": "succeeded",
    "transfer_data": null,
    "transfer_group": null
}
